Repository: andynadal/ResumeAndy
Catalog: ResumeAndy/ResumeAndy/Localizable.xcstrings
Source language: en
Languages: es

# ABOUT
source: This App showcases a simple implementation of several complex iOS programming patterns, use cases and technologies
es: Esta app muestra diversas implementaciones simples, de múltiples patrones de programación de iOS.

# ABOUT-THIS-APP-HEADLINE
source: About this App
es: Sobre esta App

# ABOUT-TITLE
source: About
es: Información

source: App icon
es: Icono de App

source: Concurrent programming
es: Programación concurrente

# CONCURRENT-PROGRAMMING-BODY
source: Swift's concurrency model, is the best way to insure good code readability and debugging.
es: El modelo de concurrencia de Swift, es la mejor forma de tener buenas prácticas y legibilidad, en cuanto a procesos asíncronos

# CONTACT-TITLE
source: Contact
es: Contacto

# EDUCATION-TITLE
source: Education
es: Educación

# EXPERIENCE-TITLE
source: Experience
es: Experiencia

# FEATURES-HEADLINE
source: Features
es: Funcionalidades

source: Framework-based programming
es: Programación en base a frameworks

# FRAMEWORK-BASED-PROGRAMMING-BODY
source: A framework-based design, allows C.L.E.A.N. code practices, in this case there's a utility and networking framework.
es: Un patrón de diseño en base a frameworks, permite prácticas de código C.L.E.A.N., en este caso se utilizó un framework para utilidades y otro para servicios.

source: Go to App Store
es: Ver en App Store

# GRAPH-QL-BODY
source: This App uses a head-less CMS, to fetch the data this app shows on Experience, Apps and Education
es: Esta app usa un CMS para obtener la información mostrada en Experiencia, Apps y Educación.

source: Investors
es: Inversionistas

source: Localization
es: Internacionalización

# LOCALIZATION-BODY
source: An international, scalable app must be ready for localization since the beginning, since the implementation is easy, and cost of changing it down-the-line is high.
es: Un app de escala global, debe estar lista para ser la internacionalización, ya que trabajar desde el principio con ello en mente, evita re-trabajos costosos.

source: MVVM Architecture
es: Arquitectura MVVM

# MVVM-ARCHITECTURE-BODY
source: MVVM using Combine is reactive, it can be used in both UIKit and SwiftUI, when used properly, it can avoid common programming errors and bugs, the thing to get right are data synchronizations
es: Usar MVVM junto con Combine es un patrón reactivo, que se puede usar tanto en UIKit como en SwiftUI, cuando se implementa de manera correcta, puede evitar muchos errores y bugs comunes, pero se tiene que conectar la información de manera correcta.

source: Present
es: Presente

source: Secret obfuscation
es: Ofuscación de secretos

# SECRET-OBFUSCATION-BODY
source: As part of a continuous cybersecurity effort, apps must be ready for a reverse engineering attack, hence secrets, such as API keys, cannot be stored as strings, an obfuscater turns them into unreadable binary, the app decodes at runtime.
es: Parte del esfuerzo continuo de cíber seguridad, las apps deben estar listas contra un ataque de ingeniería inversa, por lo tanto secretos como las llaves de una API, no pueden estar guardadas como un string, un ofuscador permite convertirlas a binary, que el app decodifique al correr el programa.

# TAB-ABOUT
source: About
es: Información

# TAB-CONTACT
source: Contact
es: Contacto

# TAB-EDUCATION
source: Education
es: Educación

# TAB-EXPERIENCE
source: Experience
es: Experiencia
